CREATE TABLE municipality_names
(
    id INTEGER PRIMARY KEY,
    kanji TEXT UNIQUE NOT NULL,
    kana TEXT UNIQUE NOT NULL
);

INSERT INTO municipality_names
(
        id, kanji, kana
)
VALUES
    (12100, '千葉市', 'ちばし'),
    (12101, '中央区', 'ちゅうおうく'),
    (12102, '花見川区', 'はなみがわく'),
    (12103, '稲毛区', 'いなげく'),
    (12104, '若葉区', 'わかばく'),
    (12105, '緑区', 'みどりく'),
    (12106, '美浜区', 'みはまく'),
    (12202, '銚子市', 'ちょうしし'),
    (12203, '市川市', 'いちかわし'),
    (12204, '船橋市', 'ふなばしし'),
    (12205, '館山市', 'たてやまし'),
    (12206, '木更津市', 'きさらづし'),
    (12207, '松戸市', 'まつどし'),
    (12208, '野田市', 'のだし'),
    (12210, '茂原市', 'もばらし'),
    (12211, '成田市', 'なりたし'),
    (12212, '佐倉市', 'さくらし'),
    (12213, '東金市', 'とうがねし'),
    (12215, '旭市', 'あさひし'),
    (12216, '習志野市', 'ならしのし'),
    (12217, '柏市', 'かしわし'),
    (12218, '勝浦市', 'かつうらし'),
    (12219, '市原市', 'いちはらし'),
    (12220, '流山市', 'ながれやまし'),
    (12221, '八千代市', 'やちよし'),
    (12222, '我孫子市', 'あびこし'),
    (12223, '鴨川市', 'かもがわし'),
    (12224, '鎌ヶ谷市', 'かまがやし'),
    (12225, '君津市', 'きみつし'),
    (12226, '富津市', 'ふっつし'),
    (12227, '浦安市', 'うらやすし'),
    (12228, '四街道市', 'よつかいどうし'),
    (12229, '袖ヶ浦市', 'そでがうらし'),
    (12230, '八街市', 'やちまたし'),
    (12231, '印西市', 'いんざいし'),
    (12232, '白井市', 'しろいし'),
    (12233, '富里市', 'とみさとし'),
    (12234, '南房総市', 'みなみぼうそうし'),
    (12235, '匝瑳市', 'そうさし'),
    (12236, '香取市', 'かとりし'),
    (12237, '山武市', 'さんむし'),
    (12238, 'いすみ市', 'いすみし'),
    (12239, '大網白里市', 'おおあみしらさとし'),
    (12320, '印旛郡', 'いんばぐん'),
    (12322, '酒々井町', 'しすいまち'),
    (12329, '栄町', 'さかえまち'),
    (12340, '香取郡', 'かとりぐん'),
    (12342, '神崎町', 'こうざきまち'),
    (12347, '多古町', 'たこまち'),
    (12349, '東庄町', 'とうのしょうまち'),
    (12400, '山武郡', 'さんぶぐん'),
    (12403, '九十九里町', 'くじゅうくりまち'),
    (12409, '芝山町', 'しばやままち'),
    (12410, '横芝光町', 'よこしばひかりまち'),
    (12420, '長生郡', 'ちょうせいぐん'),
    (12421, '一宮町', 'いちのみやまち'),
    (12422, '睦沢町', 'むつざわまち'),
    (12423, '長生村', 'ちょうせいむら'),
    (12424, '白子町', 'しらこまち'),
    (12426, '長柄町', 'ながらまち'),
    (12427, '長南町', 'ちょうなんまち'),
    (12440, '夷隅郡', 'いすみぐん'),
    (12441, '大多喜町', 'おおたきまち'),
    (12443, '御宿町', 'おんじゅくまち'),
    (12460, '安房郡', 'あわぐん'),
    (12463, '鋸南町', 'きょなんまち');

CREATE TABLE municipality_parents
(
    id INTEGER NOT NULL,
    parent_id INTEGER NOT NULL
);

INSERT INTO municipality_parents
(
        id, parent_id
)
VALUES
    (12101, 12100),
    (12102, 12100),
    (12103, 12100),
    (12104, 12100),
    (12105, 12100),
    (12106, 12100),
    (12322, 12320),
    (12329, 12320),
    (12342, 12340),
    (12347, 12340),
    (12349, 12340),
    (12403, 12400),
    (12409, 12400),
    (12410, 12400),
    (12421, 12420),
    (12422, 12420),
    (12423, 12420),
    (12424, 12420),
    (12426, 12420),
    (12427, 12420),
    (12441, 12440),
    (12443, 12440),
    (12463, 12460);
